In [36]:
import pandas as pd
import numpy as np

In [17]:
df = pd.read_csv('Titanic.csv', na_values = ['?'])

<h1> 1. Inspekcja 20 pierwszych wierszy danych dotyczacych rejsu Titanica </h1>

In [18]:
df.head(20)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47.0000,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
12,1,1,"Aubart, Mme. Leontine Pauline",female,24.0000,0,0,PC 17477,69.3000,B35,C,9,NaN,"Paris, France"
13,1,1,"Barber, Miss. Ellen 'Nellie'",female,26.0000,0,0,19877,78.8500,NaN,S,6,NaN,NaN
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0000,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
16,1,0,"Baxter, Mr. Quigg Edmond",male,24.0000,0,1,PC 17558,247.5208,B58 B60,C,NaN,NaN,"Montreal, PQ"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0000,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
18,1,1,"Bazzani, Miss. Albina",female,32.0000,0,0,11813,76.2917,D15,C,8,NaN,NaN
19,1,0,"Beattie, Mr. Thomson",male,36.0000,0,0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN"

Widzimy 20 pierwszych wierszy oraz kolumny: pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body i home.dest

<h1> 2. Sprawdzanie ilosci nulli w naszym datasecie. </h1>

In [19]:
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [20]:
df.isnull().mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of       pclass  survived   name    sex    age  sibsp  parch  ticket   fare  \
0      False     False  False  False  False  False  False   False  False
1      False     False  False  False  False  False  False   False  False
2      False     False  False  False  False  False  False   False  False
3      False     False  False  False  False  False  False   False  False
4      False     False  False  False  False  False  False   False  False
...      ...       ...    ...    ...    ...    ...    ...     ...    ...
1304   False     False  False  False  False  False  False   False  False
1305   False     False  False  False   True  False  False   False  False
1306   False     False  False  False  False  False  False   False  False
1307   False     False  False  False  False  False  False   False  False
1308   False     False  False  False  False  False  False   False  False

      cabin  embarked   boat   body  home.dest
0     False     False  False   True      False
1     False     False  False   True      False
2     False     False   True   True      False
3     False     False   True  False      False
4     False     False   True   True      False
...     ...       ...    ...    ...        ...
1304   True     False   True  False       True
1305   True     False   True   True       True
1306   True     False   True  False       True
1307   True     False   True   True       True
1308   True     False   True   True       True

[1309 rows x 14 columns]>

In [21]:
df.isnull().values.any()

True

In [26]:
null_count = df.isnull().sum().sum()
null_count

3855

In [30]:
df.shape[0]

1309

In [32]:
percentage_of_nulls = null_count / (1309 * 14) * 100
percentage_of_nulls

21.035687002073555

In [35]:
null_count = df.isnull().sum()
nulls = null_count/df.shape[0] * 100
nulls

pclass        0.000000
survived      0.000000
name          0.000000
sex           0.000000
age          20.091673
sibsp         0.000000
parch         0.000000
ticket        0.000000
fare          0.076394
cabin        77.463713
embarked      0.152788
boat         62.872422
body         90.756303
home.dest    43.086325
dtype: float64

<h1> 3. Rodzaj brakow danych wystepujacych w zbiorze danych (MCAR)/(MAR)/(MNAR) </h1>

Braki w danych (tzw. null'e), ktore wystepuja w naszym zbiorze danych wydaja sie nie byc przypadkowymi brakami - MNAR. Najczesciej brakuje danych w kolumnie body - wartosc na poziomie ponad 1100 - ponad 90% brakow. Wysoki jest rowniez odsetek brakow dla kolumny cabin. Taka ilosc brakow w danych jest spowodowana (prawdopodobnie) przez smierc tych osob i niemoznosc uzupelnienia danych.

In [46]:
df['KolumnaNull'] = np.where(df['cabin'].isnull(), 1, 0)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,KolumnaNull
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",0
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0

In [47]:
df.groupby(['survived'])['KolumnaNull'].mean()

survived
0    0.873918
1    0.614000
Name: KolumnaNull, dtype: float64

Na podstawie powyzszego wyniku mozemy koncowo stwierdzic, ze faktycznie braki w danych sa typu MNAR.

Jednolinijkowiec z dwoch powyzszych:

In [ ]:
#?

<h1> 4. W jaki sposob postapic z brakujacymi wartosciami? </h1>

W przypadku naszego zbiorow danych odsetek brakow jest dosyc duzy, dodatkowo braki te nie wydaja sie byc calkowicie losowe ani wynikiem bledu. W tym przypadku mozemy powiazac informacje o tym, czy danej osobie udalo sie przezyc katastrofe statku z brakami w danych i wprowadzic zmienna binarna, ktora mozna wykorzystac do dalszej analizy danych.

<h1> Cwiczenie 3 </h1>

<h1> 1. Liczebnosc poszczegolnych etykiet dla zmiennych jakosciowych </h1>

In [54]:
print('Liczba etykiet zmiennej cabin: {}'.format(len(df.cabin.unique())))

Liczba etykiet zmiennej cabin: 187

<h1> 2. Liczba wszystkich pasazerow. </h2>

In [55]:
print('Liczba wszystkich pasazerow tragicznego rejsu: ' + repr(len(df.name.unique())))

Liczba wszystkich pasazerow tragicznego rejsu: 1307

<h1> 3. Podzial zbioru ze wzgledu na kardynalnosc (moc zbioru).

In [59]:
print('Liczba unikalnych destynacji: ' + repr(len(df['home.dest'].unique())))

Liczba unikalnych destynacji: 370

Kolumny (zmienne) takie jak name, home.dst, cabin maja wysoka kardynalnosc (duza moc zbioru).
Natomiast kolumny takie jak sex czy pozostale maja duzo nisza liczbe etykiet - niska moc zbioru.

In [69]:
z = np.array(df['cabin'].unique())
type(z)

numpy.ndarray

PandasDF zuzywaja wiecej pamieci, NumpyArray sa szybsze, dla danych tabelarycznych czesciej wykorzystuje sie PandasDataFrame, dla danych numerycznych raczej NumpyArray.

In [78]:
df['CabinReduced'] = df.cabin.astype(str).str[0]
df[['cabin', 'CabinReduced']].head(20)

      cabin CabinReduced
0        B5            B
1   C22 C26            C
2   C22 C26            C
3   C22 C26            C
4   C22 C26            C
5       E12            E
6        D7            D
7       A36            A
8      C101            C
9       NaN            n
10  C62 C64            C
11  C62 C64            C
12      B35            B
13      NaN            n
14      A23            A
15      NaN            n
16  B58 B60            B
17  B58 B60            B
18      D15            D
19       C6            C

In [79]:
print('Liczba etykiet zmiennej CabinReduced: {}'.format(len(df.CabinReduced.unique())))

Liczba etykiet zmiennej CabinReduced: 9

In [81]:
print('Ilosc kolumn zredukowano o: '+ repr((1 - len(df.CabinReduced.unique()) / len(df.cabin.unique())) * 100) + '%')

Ilosc kolumn zredukowano o: 95.18716577540107%